from colorama import init, Fore

init(autoreset=True)

skull = '''
                      :::!~!!!!!:.
                  .xUHWH!! !!?M88WHX:.
                .X*#M@$!!  !X!M$$$$$$WWx:.
               :!!!!!!?H! :!$!$$$$$$$$$$8X:
              !!~  ~:~!! :~!$!#$$$$$$$$$$8X:
             :!~::!H!<   ~.U$X!?R$$$$$$$$MM!
             ~!~!!!!~~ .:XW$$$U!!?$$$$$$RMM!
               !:~~~ .:!M"T#$$$$WX??#MRRMMM!
               ~?WuxiW*`   `"#$$$$8!!!!??!!!
             :X- M$$$$       `"T#$T~!8$WUXU~
            :%`  ~#$$$m:        ~!~ ?$$$$$$
          :!`.-   ~T$$$$8xx.  .xWW- ~""##*"
.....   -~~:<` !    ~?T#$$@@W@*?$$      /`
W$@@M!!! .!~~ !!     .:XUW$W!~ `"~:    :
#"~~`.:x%`!!  !H:   !WM$$$$Ti.: .!WUn+!`
:::~:!!`:X~ .: ?H.!u "$$$B$$$!W:U!T$$M~
.~~   :X@!.-~   ?@WTWo("*$$$W$TH$! `
Wi.~!X$?!-~    : ?$$$B$Wu("**$RM!
$R@i.~~ !     :   ~$$$$$B$$en:``
?MXT@Wx.~    :     ~"##*$$$$M~
'''

skull_horns = '''
          .                                                      .
        .n                   .                 .                  n.
  .   .dP                  dP                   9b                 9b.    .
 4    qXb         .       dX                     Xb       .        dXp     t
dX.    9Xb      .dXb    __                         __    dXb.     dXP     .Xb
9XXb._       _.dXXXXb dXXXXbo.                 .odXXXXb dXXXXb._       _.dXXP
 9XXXXXXXXXXXXXXXXXXXVXXXXXXXXOo.           .oOXXXXXXXXVXXXXXXXXXXXXXXXXXXXP
  `9XXXXXXXXXXXXXXXXXXXXX'~   ~`OOO8b   d8OOO'~   ~`XXXXXXXXXXXXXXXXXXXXXP'
    `9XXXXXXXXXXXP' `9XX'   DIE    `98v8P'  HUMAN   `XXP' `9XXXXXXXXXXXP'
        ~~~~~~~       9X.          .db|db.          .XP       ~~~~~~~
                        )b.  .dbo.dP'`v'`9b.odb.  .dX(
                      ,dXXXXXXXXXXXb     dXXXXXXXXXXXb.
                     dXXXXXXXXXXXP'   .   `9XXXXXXXXXXXb
                    dXXXXXXXXXXXXb   d|b   dXXXXXXXXXXXXb
                    9XXb'   `XXXXXb.dX|Xb.dXXXXX'   `dXXP
                     `'      9XXXXXX(   )XXXXXXP      `'
                              XXXX X.`v'.X XXXX
                              XP^X'`b   d'`X^XX
                              X. 9  `   '  P )X
                              `b  `       '  d'
                               `             '
'''

cute_skull = '''
   _______
  /       \\
 /  O   O  \\
|     ^     |
|    '-'    |
 \\_________/ 
     |||
     |||
     |||
'''

lessidoidlam1 = '''                                                                                                                                                                                               
                                                                   ÆÆgÆÆí                                                             
                                                6gÅÆÆÆ            Þí  ÏÇÆÆ                                                            
                                                ü  íÏÆÆ           6í— üüÆÆ         ÅÆÅ                                                
                                                ü—  6GÆ           ü—Ç ÏGÆÆ       gÇzzÞÆü                                              
                                                Ç{ üíÏÆ          Þ{›{ÞÏüÏÆ       ü {ÏÏÆÆ                                              
                                 —ÆÆÆÆ          Þ {z—zGÆ         üí›züzÇGÆ      6{— zGÆÆ                                              
                                 G—›{ÆÆ         Ï›66  üÆ         6{66—zÏÆÏ     Æ— ››Ç6GÆ                                              
                                 6—››ÏÆÆ        6››ÏÞígÆ         6—›zíÏÏÆ      ü  ÏÏÏÏÇÆ                                              
                                 zz  {íÆÆ       Ç   z›—Æ         z {í——ÏÆ      ÞíüÆí{ÏÆÞ                                              
                                  Þ{—ÇzÏüü      Ïz —ízíÇÆ       6— ›{——ÏÆ     Þ—›íz—ÏgÆ                                               
                                   Ï Ï{ ÏÆ       í   —ÏÏÆ       6—{ü6ü{ÏÆ     Ï {ü› ÏÅÆ                                               
                       ÅÞÅÆÆ       6—{üü›üÆ      Ï—›zí{{ÇÅ      ü íÏÏ  ÆÆ    6  —6—í6Æ                                                
                      üü ——ÅÆ       6— {{›ÞÆ     z› —z—züÆ     íÇízz  ÆüÆ    {{íz{{ÏüÆ                                                
                       6—  üGÆÅ      G›› {zÅÆ    Ï—   {ÏÏÆ     6›—66zíÆÆÆ   Å—   ›íÏÆÆ                                                
                       6— Ï ízÅü      z  {—zGg   6Ï›—{üzíÞÆ    6›—{  ÏÆÆ   Þ›z6ÇÏÏÏGÆ                                                 
                        Çí {z6ÏÆ      Ç{ —í{—Æz   {   {í›ÏÆ    z   íüÆÆÆ   z{› íízÇÆÆ                                                 
                         Ï—{ü6ÇÏÆ      z—   Ï6Æ   Ï { ›—ííÆ   6{   züGüÆ  Ï{›{6z{ÏÞÆ                                                  
                          ü{  —{zGÆ     Þ í6ÏíÏÆ  6››› ›ü üÆ  Ç›  {{zÏÆÞ 6   ——›í6ÆÆ                                                  
                           Ï›  ›{{ÏÆ    —{{›ÏÏíÆÆ  í››{—  zÆ  z  —›zÏÅÆ Ï{ › — —ÏüÆ                                                   
                            Ï    ízÅÆÆ   Ç{› › zÞÆ —    —í{ÆÆ6zzÏÏzüÞÆÆÏ——  ›››—zÆÆ                                                   
                             üz› —›—zzÏÆ  Ï› › ››üÆ     {í{  {{{zzí     ——zÏÇ{{ÏÅÆ                                                    
                               Çí{ — {üÏÇ  {   {íGÆgz› {íí— 6í———›í— ›ízíí{{zÏ6ÆÆ                                                     
                                6›   ›{—ÇÏÅ › Ïü››   —6í  —Çü  ——{›  —{Ïí{{{—Ï{üÆ                                                     
                                 {Ï  ——›  6üÇ íí› ››—{ ————Ïz›—{ ›     {›—{6íÏÏÇÆ                                                     
                                   Ï{ ›—›{ —6z6›  {üü—{{›———› — ›    › {—›—í{ÏÇÆÆ                   ÆÆÆÆÆÆÆÆÆÆ                        
                                    ÇzÏ{  ›{í›{—ízízÏzí{ ——››—íü      ›{z—   —ÇÆ                ÆÆÆ6ÏzüÏzz—zÏÇÆ6                      
                                     zí› › ›— {— ›z{{zzz  ——zÏí—  ›{—› — ›zÏÏüÞÆG             GüÏzzz{zz{ízÏÆÆÆÆ                       
                                      z›—   Ç›í›íí{zíÏz—— zü——    ››—í{›{ zü— ›ÞÆ           Å6ü—í  ›zíÏüÇgÆÆ                          
                                      ÏÏ—  {  ›{{{——zzÏ6Çí  —›  — —{  › —í   ÆÞÏÆ         Å6Ï     íüüíügÆ›                            
                                       z    ›{›üzzzGüÏ{   ›   ›Ï› › ››— ›{{üÏ  gÆÆ      Åz{ ›   üÇ›{ÏgÆ                               
                                       6íízzüÏz{› {——  ››› ›ü{   ›› — ›  › { {zÞÆÆÆ   Þz{{—   —íz ÏÆÆ                                 
                                       üí      —í—üí{íÏ{——Ï —   ›     —í— ›  ›     íÏz{    › › ü6ÆÆ                                   
                                       Ï{     ›——z{íÏííí6 › {{ Ï  ›› › ››    {—í—íí{    ››    gÇÆÆ                                    
                                        Ï› ›   — —í{zíz{zí› ››í› ›   ›     —›——{—{—› ›—  ›  í6gÆ                                      
                                        z›     ›——z{Ï——{íz{ ››     › {››  {zí››— zzÞ  ›—   —ÏÆÆ                                       
                                        ü›› ›—›  {{{—ízzííÏ  z›—{{í—{íízíüü  z{Ï6 ›í {—   zÏÅÆ                                        
                                        Ï  ›     —› ÏÏz{z{í{íí›—›           ››    ›zz  zzÏÏÆÆ                                         
                                        üí      ü íí6——íí{—íÏ›—{ ›— z—Ï—›{—ü›› íz { ›z6z{gÆÆ                                          
                                        {z{{{—  {—íü z——›—íz—››  ››      ›     › {{zzÇíÏÆÆ                                            
                                         Ïí{ —{{íü›—  ›——›—í››         ›z—›››íízzÏí6ÏGÆÆ                                              
                                          z› { › —{ ›  í›— Ï        ›     ›—zíÏ6Ï6ÏüÆÆ                                                
                                          Ïí›{››í—  {›Ï— { í  íÞ   ›{ {Ïü{z—üí{züÅÆÆ                                                  
                                           üÏz—í›››{í›  íz {››› zzzzÏzí—›í{———ÇÅÆ                                                     
                                            zÏ——››zzÏÏzÏ›Ïzüzíüí{í››   {{——zGÆÆ                                                       
                                             Ïz—{——{›— { züÏ —ízí{Ï66ÏzííÏüÆÆ                                                         
                                              66ÏüÏü6ü6ÏÇÏüÇ6ÏÇ6zÏüzÏÇÞGggÆÆ                                                          
                                               —Ïz6{———›        ›—{6ÏÏüüzÇÅG                                                          
                                               —í— íííízü{  {í—››{ííz—{ÏüGÆÆ                                                          
                                                {  › ›   ›———› ››—ííÏÇ6ÏÏGgÆ                                                          
                                                z›           › ———íí{Ï66ÇÞÞÆ                                                          
                                                ü›  ››  —› —›››{{{—íízÏÞÇÞGÆÆ                                                         
                                                 í ›—————›› ›› ››{í{íÏüÏ6üÇGÆ                                                         
                                                 6 —  —  ›› ›—›  íz{—{zÏüÇÇÞÆ                                                         
                                                 Ï  í—{—›——››››››{{››ÏzÏ666ÞÆÆ                                                        
                                                 üz   ››››››{ ›  ›ííízzÏüü6ÏGÆ                                                        
                                                  z›í{››—›— —›  —›í—{{ízü6üüGÆÆ                                                       
                                                  Ï   —›—›—› ››››  zÏííí6üüüÞgÆ                                                       
                                                  ü››— ›   ›››››— ›{íí{ÇzÏÏÏüGÆÆ                                                      
                                                  Ï›››   —››››{—————{ü{{{üÏÇÏGgÆ                                                      
                                                  6—››—› › ›—››  ›—›—ÏzzzzÏÏüÇgÆü                                                     
                                                   z››››››››—›{———››—{íüzüüÏüÇgÆÆ                                                     
                                                   Ï› › ››—›››››{—{í—{zÏÏü{z6üÞGÆ                                                     
                                                   z{›—›››—›››—››—› ——›{ÏÏüüüÏÇÆÆÆ                                                    
                                                   {{ ››› ››› ››››› ›{ííííüÏü6ÇÞÅÆ                                                    
                                                   íz››—›—›{——›››{{zí——{zÏÏ66Ï6ÇÆÆÆ                                                   
                                                    z›› ››  ››——›——›——{ííüÇüÇ66üGÅÆ                                                   
                                                    ü›—›——››››››————{{—{zízÏÏ666ÞgÆÆ                                                  
                                                    6››››› ›————› ›—{{—{{íÏ6Ï6ÏüüÞÅÆÆ                                                 
                                                    Ç ›› ››› › ›—›—›——{{—ízÏz6Ï66ÇgÆÆÆ                                                
                                                    z6›—›—››——››—›—›—{—{ÏííÏ6Ç6üÇüGgÞÆÆ                                               
                                                                            —{{zzzzzÏÏÏÅ                                              
'''

ascii_art_dict = {
    'skull': skull,
    'skull_horns': skull_horns,
    'cute_skull': cute_skull,
    "6doigts": lessidoidlam1
}

def print_ascii_art(ascii_name):
    ascii_art = ascii_art_dict.get(ascii_name)

    if ascii_art is None:
        return

    print(Fore.GREEN + ascii_art)
